# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Thomas\Documents\GitHub\MotorController\MotorController.cydsn\MotorController.cyprj
# Date: Wed, 11 May 2016 11:04:48 GMT
#set_units -time ns
create_clock -name {ADC_V_theACLK(routed)} -period 875 -waveform {0 437.5} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {ADC_A_theACLK(routed)} -period 875 -waveform {0 437.5} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {Clock_3(routed)} -period 370375 -waveform {0 185187.5} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {Clock_motor(routed)} -period 5000000 -waveform {0 2500000} [list [get_pins {ClockBlock/dclk_7}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyBUS_CLK(fixed-function)} -period 41.666666666666664 -waveform {0 20.8333333333333} [get_pins {ClockBlock/clk_bus_glb_ff}]
create_generated_clock -name {emFile_1_Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 9} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {ADC_V_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 21 43} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {ADC_A_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 21 43} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 8889 17779} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Clock_4} -source [get_pins {ClockBlock/clk_sync}] -edges {1 24001 48001} [list [get_pins {ClockBlock/dclk_glb_5}]]
create_generated_clock -name {clock_Speedometer} -source [get_pins {ClockBlock/clk_sync}] -edges {1 24001 48001} [list [get_pins {ClockBlock/dclk_glb_6}]]
create_generated_clock -name {Clock_motor} -source [get_pins {ClockBlock/clk_sync}] -edges {1 120001 240001} [list [get_pins {ClockBlock/dclk_glb_7}]]


# Component constraints for C:\Users\Thomas\Documents\GitHub\MotorController\MotorController.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Thomas\Documents\GitHub\MotorController\MotorController.cydsn\MotorController.cyprj
# Date: Wed, 11 May 2016 11:04:34 GMT
